RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_cortex.h
/**
  ******************************************************************************
  * @file    stm32h5xx_ll_cortex.h
  * @author  MCD Application Team
  * @brief   Header file of CORTEX LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL CORTEX driver contains a set of generic APIs that can be
    used by user:
      (+) SYSTICK configuration used by @ref LL_mDelay and @ref LL_Init1msTick
          functions
      (+) Low power mode configuration (SCB register of Cortex-MCU)
      (+) API to access to MCU info (CPUID register)
      (+) API to enable fault handler (SHCSR accesses)
      (+) API to enable and disable the MPU secure and non-secure
      (+) API to configure the region of MPU secure and non-secure
      (+) API to configure the attributes region of MPU secure and non-secure

  @endverbatim
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H5xx_LL_CORTEX_H
#define STM32H5xx_LL_CORTEX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx.h"

/** @addtogroup STM32H5xx_LL_Driver
  * @{
  */

/** @defgroup CORTEX_LL CORTEX
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup CORTEX_LL_EC_REGION_ACCESS CORTEX LL MPU Region Access Attributes
  * @{
  */
/* Register MPU_RBAR (Cortex-M33) : bits [4:0] */
#define MPU_ACCESS_MSK                     (MPU_RBAR_SH_Msk|MPU_RBAR_AP_Msk|MPU_RBAR_XN_Msk)
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup CORTEX_LL_Exported_Constants CORTEX LL Exported Constants
  * @{
  */

/** @defgroup CORTEX_LL_EC_CLKSOURCE_HCLK SYSTICK Clock Source
  * @{
  */
#define LL_SYSTICK_CLKSOURCE_HCLK_DIV8     0x00000000U                 /*!< AHB clock divided by 8 selected as SysTick
                                                                            clock source */
#define LL_SYSTICK_CLKSOURCE_HCLK          SysTick_CTRL_CLKSOURCE_Msk  /*!< AHB clock selected as SysTick
                                                                            clock source */
/**
  * @}
  */

/** @defgroup CORTEX_LL_EC_FAULT Handler Fault type
  * @{
  */
#define LL_HANDLER_FAULT_USG               SCB_SHCSR_USGFAULTENA_Msk              /*!< Usage fault */
#define LL_HANDLER_FAULT_BUS               SCB_SHCSR_BUSFAULTENA_Msk              /*!< Bus fault */
#define LL_HANDLER_FAULT_MEM               SCB_SHCSR_MEMFAULTENA_Msk              /*!< Memory management fault */
#define LL_HANDLER_FAULT_SECURE            SCB_SHCSR_SECUREFAULTENA_Msk           /*!< Secure fault */
/**
  * @}
  */

/** @defgroup CORTEX_LL_MPU_HFNMI_PRIVDEF_Control CORTEX LL MPU HFNMI and PRIVILEGED Access control
  * @{
  */
#define LL_MPU_CTRL_HFNMI_PRIVDEF_NONE     0U /*!< MPU is disabled during HardFault and NMI handlers,
                                                   privileged software access to the default memory map is disabled */
#define LL_MPU_CTRL_HARDFAULT_NMI          2U /*!< MPU is enabled during HardFault and NMI handlers,
                                                   privileged software access to the default memory map is disabled */
#define LL_MPU_CTRL_PRIVILEGED_DEFAULT     4U /*!< MPU is disabled during HardFault and NMI handlers,
                                                   privileged software access to the default memory map is enabled  */
#define LL_MPU_CTRL_HFNMI_PRIVDEF          6U /*!< MPU is enabled during HardFault and NMI handlers,
                                                   privileged software access to the default memory map is enabled  */
/**
  * @}
  */

/** @defgroup CORTEX_LL_MPU_Attributes CORTEX LL MPU Attributes
  * @{
  */
#define  LL_MPU_DEVICE_nGnRnE              0x0U  /*!< Device, noGather, noReorder, noEarly acknowledge. */
#define  LL_MPU_DEVICE_nGnRE               0x4U  /*!< Device, noGather, noReorder, Early acknowledge.   */
#define  LL_MPU_DEVICE_nGRE                0x8U  /*!< Device, noGather, Reorder, Early acknowledge.     */
#define  LL_MPU_DEVICE_GRE                 0xCU  /*!< Device, Gather, Reorder, Early acknowledge.       */

#define  LL_MPU_WRITE_THROUGH              0x0U  /*!< Normal memory, write-through.  */
#define  LL_MPU_NOT_CACHEABLE              0x4U  /*!< Normal memory, non-cacheable.  */
#define  LL_MPU_WRITE_BACK                 0x4U  /*!< Normal memory, write-back.     */

#define  LL_MPU_TRANSIENT                  0x0U  /*!< Normal memory, transient.      */
#define  LL_MPU_NON_TRANSIENT              0x8U  /*!< Normal memory, non-transient.  */

#define  LL_MPU_NO_ALLOCATE                0x0U  /*!< Normal memory, no allocate.         */
#define  LL_MPU_W_ALLOCATE                 0x1U  /*!< Normal memory, write allocate.      */
#define  LL_MPU_R_ALLOCATE                 0x2U  /*!< Normal memory, read allocate.       */
#define  LL_MPU_RW_ALLOCATE                0x3U  /*!< Normal memory, read/write allocate. */
/**
  * @}
  */

/** @defgroup CORTEX_LL_MPU_Region_Enable CORTEX LL MPU Region Enable
  * @{
  */
#define LL_MPU_REGION_ENABLE               1U  /*!< MPU region enabled  */
#define LL_MPU_REGION_DISABLE              0U  /*!< MPU region disabled */
/**
  * @}
  */

